Reports/ОбщийОтчетОПроизводительностиСервера_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОбщийОтчетОПроизводительностиСервера_ат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ТипыРесурсовWMI_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыРесурсовWMI_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CPU_proc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AvgDiskQueueLength</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DiskBytesPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HDD_proc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RAM_proc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FreeMegabytesHDD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FreePhysicalMemory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Processes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>StaticSQL_ReCompilations_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Statistic_Batch_Requests_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Statistic_WorkfilesCreated_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PlanCache_CachePages</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PlanCache_percentSQLPlanCacheHitRation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManager_percentBufferCacheHitRatio</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManager_PageReads_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManagerPageLifeExpectancy</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManager_LazyWrites_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManager_Checkpoints_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccessMethod_IndexSearches_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccessMethod_FullScans_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Databases_LogFlushWaitTime</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Databases_LogFlushWaits_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DatabaseReplicaRecoveryQueue</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DatabaseReplica_RedoneBytes_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Static_SQLCompilations_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Pagelifeexpectancy</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Buffercachehitratio</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PagereadsPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LazywritesPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IndexSearchesPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FullScansPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LogFlushWaitTime</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LogFlushWaitsPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FactConnection</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОбщийОтчетОПроизводительностиСервера_ат/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
ПараметрСервер 					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сервер"));
ПараметрСервер.Значение		= Сервер;
ПараметрСервер.Использование	= Истина;

ПараметрНачПер 					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
ПараметрНачПер.Значение		= НачалоПериода;
ПараметрНачПер.Использование	= Истина;

ПараметрКонПер					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКонца"));
ПараметрКонПер.Значение		= КонецПериода;
ПараметрКонПер.Использование	= Истина;

ТипыРесурсов = новый СписокЗначений;
ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.CPU_proc);
ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.RAM_proc);
ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.HDD_proc);

ПараметрТипРес1						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипыРесурсов"));
ПараметрТипРес1.Значение			= ТипыРесурсов;
ПараметрТипРес1.Использование	= Истина;


//ТипРесурса1 = Перечисления.ТипыРесурсовWMI_ат.CPU_proc;
//ТипРесурса2 = Перечисления.ТипыРесурсовWMI_ат.RAM_proc;
//ТипРесурса3 = Перечисления.ТипыРесурсовWMI_ат.HDD_proc;

//ПараметрТипРес1						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипРесурса1"));
//ПараметрТипРес1.Значение			= ТипРесурса1;
//ПараметрТипРес1.Использование	= Истина;

//ПараметрТипРес2						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипРесурса2"));
//ПараметрТипРес2.Значение			= ТипРесурса2;
//ПараметрТипРес2.Использование	= Истина;

//ПараметрТипРес3						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипРесурса3"));
//ПараметрТипРес3.Значение			= ТипРесурса3;
//ПараметрТипРес3.Использование	= Истина;

КонецПроцедуры
